#+TITLE: Merge Tree Computation
* Convert merge tree to matrix
#+BEGIN_SRC python :results output :session real-data
import numpy as np
np.set_printoptions(formatter={'float': lambda x: "{0:0.3f}".format(x)})

def buildConnectivityMatrix(G, labels, node_count):
  mat = np.zeros((node_count,node_count))
  node_lookup = np.zeros(node_count)

  for node in G.nodes:
    node_val = G.nodes[node]['pos'][1]
    for label_node in [int(n) for n in labels[node].split(',')]:
      mat[label_node][label_node] = node_val
      node_lookup[label_node] = node

  for i in range(node_count):
    for j in range(i):
      mat[i,j] = mat[j,i] = getConnectivityValue(G,node_lookup[i],node_lookup[j])
  return mat

induced_matrix1 = buildConnectivityMatrix(G1, m1_as_m2_labels, 6)
induced_matrix2 = buildConnectivityMatrix(G2, m2_labels, 6)

print("Induced Matrix 1 in Relation to Merge Tree 2:")
print(induced_matrix1)
print("Induced Matrix 2:")
print(induced_matrix2)
#+END_SRC

#+RESULTS:
#+begin_example
Induced Matrix 1 in Relation to Merge Tree 2:
[[-0.392 -0.392 -0.392 -0.392 -0.392 -0.000]
 [-0.392 -2.387 -0.392 -0.392 -0.392 -0.000]
 [-0.392 -0.392 -2.387 -2.387 -2.387 -0.000]
 [-0.392 -0.392 -2.387 -2.387 -2.387 -0.000]
 [-0.392 -0.392 -2.387 -2.387 -2.387 -0.000]
 [-0.000 -0.000 -0.000 -0.000 -0.000 -0.000]]
Induced Matrix 2:
[[-0.442 -0.442 -0.442 -0.442 -0.442 -0.000]
 [-0.442 -2.387 -0.442 -0.442 -0.442 -0.000]
 [-0.442 -0.442 -1.156 -1.156 -1.156 -0.000]
 [-0.442 -0.442 -1.156 -1.624 -1.156 -0.000]
 [-0.442 -0.442 -1.156 -1.156 -1.621 -0.000]
 [-0.000 -0.000 -0.000 -0.000 -0.000 -0.000]]
#+end_example

